#+TITLE: Babel: org-mode的多语言编程环境
#+AUTHOR: Eric Schulte, Dan Davison, Tom Dye
#+DATE: <2017-04-01 Sat>
#+LAYOUT: post
#+OPTIONS: ':t author:nil ^:{}
#+STARTUP: content
#+TAGS: org-mode babel
#+CATEGORIES: org-mode
#+HTML_HEAD: <style>pre, code {font-family: monospace;}</style>

#+BEGIN_QUOTE
原文[[http://orgmode.org/worg/org-contrib/babel/intro.html][Babel: Introduction]], 由 *Eric Schulte* ,  *Dan Davison*, *Tom Dye* 编辑，维护。本文只做学习之用。
#+END_QUOTE

*** [[http://www.r-project.org/][R]]
    当前这个文件中最常用的词是？
    在 =Org-mode= 文件中:
    : #+begin_src R :colnames yes
    :   words <- tolower(scan("babel-intro.org", what="", na.strings=c("|",":")))
    :   t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
    : #+end_src

    HTML 导出的代码:
    #+begin_src R :colnames yes
    words <- tolower(scan("babel-intro.org", what="", na.strings=c("|",":")))
    t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
    #+end_src

    #+RESULTS:
    | #+end_src | #+begin_src | org-mode | code | #+name: | babel | html | that | block | pass |
    |-----------+-------------+----------+------+---------+-------+------+------+-------+------|
    |        45 |          42 |       36 |   33 |      33 |    21 |   20 |   18 |    17 |   17 |

*** =:results output= (scripting mode)
   :PROPERTIES:
   :CUSTOM_ID: results-output
   :END:
   在 /scripting mode/ 中，Babel捕获代码块的文本输出并将其放置在 =Org-mode= 的缓冲区中。
   它被称为 /scripting mode/ ，因为代码块包含一系列命令，并返回每个命令的输出。
   与功能模式不同，代码块本身除了其包含的命令的输出之外没有返回值。[fn:2]

   观察以下使用 /scripting mode/ 执行代码块的结果。
   #+name: name
   #+begin_src python :results output
   import time
   print("Hello, today's date is %s" % time.ctime())
   print('Two plus two is')
   2 + 2
   #+end_src

   #+RESULTS: name
   : Hello, today's date is Tue Apr  4 19:07:57 2017
   : Two plus two is

   在这里， /scripting mode/ 返回了python写到 =stdout= 的文本。
   因为代码块不包含最后一个语句 =(2 + 2)= 的 =print()= 语句，所以结果中不会出现4。

*** 示例 2: Babel 的测试套件
    #+BEGIN_QUOTE
    While developing Babel, we used a suite of tests implemented as a large Org-mode table.
    #+END_QUOTE
    在开发 *Babel* 时，开发者曾使用了一个居大的 =Org-mode= 表作为测试套件。
    要运行测试套件，我们只需使用 =C-u C-c C-c= 对表进行计算：运行所有测试，将结果与期望进行比较，并使用结果和通过/失败的状态信息来更新表。

    测试套件的简单版本如下.

    在 =Org-mode= 文件中，如下所示:
    : #+TBLNAME: org-babel-tests
    : | functionality    | block        | arg |    expected |     results | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | basic evaluation |              |     |             |             | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    : | shell            | basic-shell  |     |           6 |           6 | pass |
    : | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    : | python           | basic-python |     | hello world | hello world | pass |
    : | R                | basic-R      |     |          13 |          13 | pass |
    : #+TBLFM: $5='(if (= (length $3) 1) (org-sbe $2 (n $3)) (org-sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

    HTML 导出的代码:
    #+TBLNAME: org-babel-tests
    | functionality    | block        | arg |    expected |     results | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | basic evaluation |              |     |             |             | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    | shell            | basic-shell  |     |           6 |           6 | pass |
    | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    | python           | basic-python |     | hello world | hello world | pass |
    | R                | basic-R      |     |          13 |          13 | pass |
    #+TBLFM: $5='(if (= (length $3) 1) (org-sbe $2 (n $3)) (org-sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

